Процедура ОбработкаПроведения(Отказ,Режим)

	// регистр ПродажиПоНоменклатуре
	Движения.ПродажиПоНоменклатуре.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ПродажиПоНоменклатуре.Добавить();
		Движение.Период = Дата;
		Если ТипДокумента = Перечисления.ТипДокументаРеализации.Продажа Тогда
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Иначе
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;	
		КонецЕсли;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
	КонецЦикла;

	// регистр ПродажиПоКонтрагентам
	Движения.ПродажиПоКонтрагентам.Записывать = Истина;
	Движение = Движения.ПродажиПоКонтрагентам.Добавить();
	Движение.Период = Дата;
	Если ТипДокумента = Перечисления.ТипДокументаРеализации.Продажа Тогда
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Иначе
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;	
	КонецЕсли;
	Движение.Организация = Организация;
	Движение.Контрагент = Крнтрагент;
	Движение.Сумма = СуммаДокумента;

	// регистр Выручка
	Движения.Выручка.Записывать = Истина;
	Движение = Движения.Выручка.Добавить();
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Если ТипДокумента = Перечисления.ТипДокументаРеализации.Продажа Тогда
		Движение.Сумма = СуммаДокумента;
	Иначе
		Движение.Сумма = -СуммаДокумента;	
	КонецЕсли;

КонецПроцедуры